web/AngularJS.org
* Application structure

[[http://blog.safaribooksonline.com/2014/03/27/13-step-guide-angularjs-modularization/][13 step guide to modularization]]

* Deploying to Heroku from angular-fullstack

When deploying for the first time, run:

```
yo angular-fullstack:deploy heroku
```

then `cd` into the heroku dir and `git push heroku master`.

After modifying the application, use the `grunt heroku` task.
After that, `cd` and `push`.

* Libs
** angular-http-auth

A reliable solution for client-side auth handling.

https://github.com/witoldsz/angular-http-auth

Also, to enable the password manager to store the credentials, an `iframe` has
to be used alongside a `timeout` function.
The solution is then somewhat hacky.

#+begin_src xhtml
<iframe src="sink.html" name="sink"
        style="display:none"></iframe>

<form name="loginForm"
      action="sink.html" target="sink" method="post"
      ng-submit="login(credentials)"
      novalidate form-autofill-fix>
  <label for="username">Username:</label>
  <input type="text" id="username"
         ng-model="credentials.username">
  <label for="password">Password:</label>
  <input type="password" id="password"
         ng-model="credentials.password">
  <button type="submit">Login</button>
</form>
#+end_src

By providing an action, the browser's regular form-submitting logic will kick
in, but without a visible action for the user.
The action is directed to `sink.html`.

To provide autofill, some more hackage is required - due to the fact that most
browsers do not trigger an event on an autofilled input. Fortunately, the
[[http://victorblog.com/2014/01/12/fixing-autocomplete-autofill-on-angularjs-form-submit][formAutofillFix]] directive circumvents this issue.

#+begin_src javascript
.directive('formAutofillFix', function ($timeout) {
  return function (scope, element, attrs) {
    element.prop('method', 'post');
    if (attrs.ngSubmit) {
      $timeout(function () {
        element
          .unbind('submit')
          .bind('submit', function (event) {
            event.preventDefault();
            element
              .find('input, textarea, select')
              .trigger('input')
              .trigger('change')
              .trigger('keydown');
            scope.$apply(attrs.ngSubmit);
          });
      });
    }
  };
});
#+end_src

** Hotkeys
Define htokeys in JS instead of as attributes.
(attribute hotkeys tend to get tedious and unmaintainable)

http://chieffancypants.github.io/angular-hotkeys/

** angular-classy
Make the controller syntax more readable and flexible.

http://davej.github.io/angular-classy/

** generator-powder
Yeoman generator for scaffolding apps based on Express, Mongo, Angular and 
Bootstrap, powered by gulp, bower and browserify.

https://github.com/yamalight/generator-powder

** jsTags
Library for using tags (as in content tags, not ctags) in Angular.

http://eranhirs.github.io/jsTag/

* Performance
** What does slow mean?
- '$apply` > 25ms
- click handler > 100ms
- page load > 1s

** Directives
- `compile` is called only once within a repeater,
- `link` and the constructor are called once per iteration
- try to get as much work done as possible in the compile phasei
- transclusion allows a directive to `$digest` its own scope withou cousing dirty checks on bindings within the Directives

** `$$digest` and `$$apply`
- `$apply` = `$rootScope.$digest` + other stuff
- if you update a child scope `s` only, you can call `s.$digest` to dirty-check only that scope and its descendants

