web/AngularJS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org86bb17c">1. Application structure</a></li>
<li><a href="#org0f460a0">2. Deploying to Heroku from angular-fullstack</a></li>
<li><a href="#org3b987b9">3. Libs</a>
<ul>
<li><a href="#org19a0e72">3.1. angular-http-auth</a></li>
<li><a href="#org7b541df">3.2. Hotkeys</a></li>
<li><a href="#orgb663abb">3.3. angular-classy</a></li>
<li><a href="#orgdbbbeb1">3.4. generator-powder</a></li>
<li><a href="#org80b53a4">3.5. jsTags</a></li>
</ul>
</li>
<li><a href="#org2c71d14">4. Performance</a>
<ul>
<li><a href="#org4cc4f3a">4.1. What does slow mean?</a></li>
<li><a href="#orgf99e461">4.2. Directives</a></li>
<li><a href="#orgf40dfbe">4.3. `\[digest` and `\]apply`</a></li>
<li><a href="#org9e63f7f">4.4. $watch</a></li>
<li><a href="#org35d2c8d">4.5. `$eval`, `$parse` and `interpolate`</a></li>
<li><a href="#org10948be">4.6. track by `$index`</a></li>
<li><a href="#orgbf67436">4.7. `ng-if` vs `ng-show`</a></li>
<li><a href="#orgc36a625">4.8. `$$postDigest`</a></li>
<li><a href="#org81326c6">4.9. Don't dirty check when it's not needed</a></li>
<li><a href="#org2636695">4.10. Tooling</a></li>
</ul>
</li>
<li><a href="#org9db67b2">5. Tips &amp; Tricks</a>
<ul>
<li><a href="#org1882424">5.1. `ngModel`</a>
<ul>
<li><a href="#org4d30fa4">5.1.1. Writing</a>
<ul>
<li><a href="#orgbe35504">5.1.1.1. Watch out when another directive bound to teh same element as the one using `ngModel` is trying to write to scope.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7afbae9">5.2. Hacking core directives</a></li>
<li><a href="#orgc5453df">5.3. Animating ng-if</a>
<ul>
<li><a href="#org6b1435d">5.3.1. `.ng-if.ng-enter` and `.ng-if.ng-enter-active`,</a></li>
<li><a href="#orga9cfe8a">5.3.2. `.ng-if.ng-leave` and `.ng-if.ng-leave-active`,</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf8b542f">6. Understanding Dependency Injection</a>
<ul>
<li><a href="#orgad1a39f">6.1. The provider (`$provide`)</a>
<ul>
<li><a href="#orgbd07644">6.1.1. `factory`, `service` and `value`</a></li>
<li><a href="#orge25c416">6.1.2. `module` shorctut for providing</a></li>
</ul>
</li>
<li><a href="#org3ffc64e">6.2. The injector (`$injector`)</a>
<ul>
<li><a href="#orgb4d2a88">6.2.1. controller/directive/filter definition functions,</a></li>
<li><a href="#org9c2184a">6.2.2. the `$get` methods of providers.</a></li>
</ul>
</li>
<li><a href="#org2b6fd65">6.3. Configuring providers</a></li>
<li><a href="#orgb2edb84">6.4. Controllers, filters and directives</a></li>
<li><a href="#org1ab8a44">6.5. Summary</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org86bb17c" class="outline-2">
<h2 id="org86bb17c"><span class="section-number-2">1</span> Application structure</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://blog.safaribooksonline.com/2014/03/27/13-step-guide-angularjs-modularization/">13 step guide to modularization</a>
</p>
</div>
</div>

<div id="outline-container-org0f460a0" class="outline-2">
<h2 id="org0f460a0"><span class="section-number-2">2</span> Deploying to Heroku from angular-fullstack</h2>
<div class="outline-text-2" id="text-2">
<p>
When deploying for the first time, run:
</p>

<p>
```
yo angular-fullstack:deploy heroku
```
</p>

<p>
then `cd` into the heroku dir and `git push heroku master`.
</p>

<p>
After modifying the application, use the `grunt heroku` task.
After that, `cd` and `push`.
</p>
</div>
</div>

<div id="outline-container-org3b987b9" class="outline-2">
<h2 id="org3b987b9"><span class="section-number-2">3</span> Libs</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org19a0e72" class="outline-3">
<h3 id="org19a0e72"><span class="section-number-3">3.1</span> angular-http-auth</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A reliable solution for client-side auth handling.
</p>

<p>
<a href="https://github.com/witoldsz/angular-http-auth">https://github.com/witoldsz/angular-http-auth</a>
</p>

<p>
Also, to enable the password manager to store the credentials, an `iframe` has
to be used alongside a `timeout` function.
The solution is then somewhat hacky.
</p>

<div class="org-src-container">
<pre class="src src-xhtml">&lt;iframe src="sink.html" name="sink"
        style="display:none"&gt;&lt;/iframe&gt;

&lt;form name="loginForm"
      action="sink.html" target="sink" method="post"
      ng-submit="login(credentials)"
      novalidate form-autofill-fix&gt;
  &lt;label for="username"&gt;Username:&lt;/label&gt;
  &lt;input type="text" id="username"
         ng-model="credentials.username"&gt;
  &lt;label for="password"&gt;Password:&lt;/label&gt;
  &lt;input type="password" id="password"
         ng-model="credentials.password"&gt;
  &lt;button type="submit"&gt;Login&lt;/button&gt;
&lt;/form&gt;
</pre>
</div>

<p>
By providing an action, the browser's regular form-submitting logic will kick
in, but without a visible action for the user.
The action is directed to `sink.html`.
</p>

<p>
To provide autofill, some more hackage is required - due to the fact that most
browsers do not trigger an event on an autofilled input. Fortunately, the
<a href="http://victorblog.com/2014/01/12/fixing-autocomplete-autofill-on-angularjs-form-submit">formAutofillFix</a> directive circumvents this issue.
</p>

<div class="org-src-container">
<pre class="src src-javascript">.directive<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'formAutofillFix'</span>, <span style="color: #b5bd68;">function</span> <span style="color: #8abeb7;">(</span><span style="color: #f0c674;">$timeout</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">function</span> <span style="color: #f0c674;">(</span><span style="color: #f0c674;">scope</span>, <span style="color: #f0c674;">element</span>, <span style="color: #f0c674;">attrs</span><span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
    element.prop<span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">'method'</span>, <span style="color: #8abeb7;">'post'</span><span style="color: #b5bd68;">)</span>;
    <span style="color: #b5bd68;">if</span> <span style="color: #b5bd68;">(</span>attrs.ngSubmit<span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">{</span>
      $timeout<span style="color: #81a2be;">(</span><span style="color: #b5bd68;">function</span> <span style="color: #c5c8c6;">()</span> <span style="color: #c5c8c6;">{</span>
        element
          .unbind<span style="color: #8abeb7;">(</span><span style="color: #8abeb7;">'submit'</span><span style="color: #8abeb7;">)</span>
          .bind<span style="color: #8abeb7;">(</span><span style="color: #8abeb7;">'submit'</span>, <span style="color: #b5bd68;">function</span> <span style="color: #f0c674;">(</span><span style="color: #f0c674;">event</span><span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
            event.preventDefault<span style="color: #b5bd68;">()</span>;
            element
              .find<span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">'input, textarea, select'</span><span style="color: #b5bd68;">)</span>
              .trigger<span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">'input'</span><span style="color: #b5bd68;">)</span>
              .trigger<span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">'change'</span><span style="color: #b5bd68;">)</span>
              .trigger<span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">'keydown'</span><span style="color: #b5bd68;">)</span>;
            scope.$apply<span style="color: #b5bd68;">(</span>attrs.ngSubmit<span style="color: #b5bd68;">)</span>;
          <span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;
      <span style="color: #c5c8c6;">}</span><span style="color: #81a2be;">)</span>;
    <span style="color: #b5bd68;">}</span>
  <span style="color: #f0c674;">}</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b541df" class="outline-3">
<h3 id="org7b541df"><span class="section-number-3">3.2</span> Hotkeys</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Define htokeys in JS instead of as attributes.
(attribute hotkeys tend to get tedious and unmaintainable)
</p>

<p>
<a href="http://chieffancypants.github.io/angular-hotkeys/">http://chieffancypants.github.io/angular-hotkeys/</a>
</p>
</div>
</div>

<div id="outline-container-orgb663abb" class="outline-3">
<h3 id="orgb663abb"><span class="section-number-3">3.3</span> angular-classy</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Make the controller syntax more readable and flexible.
</p>

<p>
<a href="http://davej.github.io/angular-classy/">http://davej.github.io/angular-classy/</a>
</p>
</div>
</div>

<div id="outline-container-orgdbbbeb1" class="outline-3">
<h3 id="orgdbbbeb1"><span class="section-number-3">3.4</span> generator-powder</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Yeoman generator for scaffolding apps based on Express, Mongo, Angular and 
Bootstrap, powered by gulp, bower and browserify.
</p>

<p>
<a href="https://github.com/yamalight/generator-powder">https://github.com/yamalight/generator-powder</a>
</p>
</div>
</div>

<div id="outline-container-org80b53a4" class="outline-3">
<h3 id="org80b53a4"><span class="section-number-3">3.5</span> jsTags</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Library for using tags (as in content tags, not ctags) in Angular.
</p>

<p>
<a href="http://eranhirs.github.io/jsTag/">http://eranhirs.github.io/jsTag/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org2c71d14" class="outline-2">
<h2 id="org2c71d14"><span class="section-number-2">4</span> Performance</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org4cc4f3a" class="outline-3">
<h3 id="org4cc4f3a"><span class="section-number-3">4.1</span> What does slow mean?</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>'$apply` &gt; 25ms</li>
<li>click handler &gt; 100ms</li>
<li>page load &gt; 1s</li>
</ul>
</div>
</div>

<div id="outline-container-orgf99e461" class="outline-3">
<h3 id="orgf99e461"><span class="section-number-3">4.2</span> Directives</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>`compile` is called only once within a repeater,</li>
<li>`link` and the constructor are called once per iteration</li>
<li>try to get as much work done as possible in the compile phasei</li>
<li>transclusion allows a directive to `$digest` its own scope withou cousing dirty checks on bindings within the Directives</li>
</ul>
</div>
</div>

<div id="outline-container-orgf40dfbe" class="outline-3">
<h3 id="orgf40dfbe"><span class="section-number-3">4.3</span> `\[digest` and `\]apply`</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>`$apply` = `$rootScope.$digest` + other stuff</li>
<li>if you update a child scope `s` only, you can call `s.$digest` to dirty-check only that scope and its descendants</li>
</ul>
</div>
</div>
