web/AngularJS.org
** $watch
- watcher must be fast. 
- avoid touching the DOM (or use `debounce`)
- avoid deep `$watch`
- `$watchCollection` is a good alternative for deep watch
- watch only relevant data, strip it as much as possible
- watch *before* transforming - watch the input for changes rather than the output of the transformation

** `$eval`, `$parse` and `interpolate`
- call `$parse` once and use the returned function instead of calling `$eval`
- prefer `$parse` to `$interpolate`

** track by `$index`
- when using an `ng-repeat track by $index`, Angular will reuse created DOM nodes instead of creating and destroying every one of them when the model changes.

** `ng-if` vs `ng-show`
- first one does not render the DOM, the second one just hides it.

** `$$postDigest`
- firest a callback after the digest cycle is complete
- can be used to update the DOM once after dirty checking is over - not recommended, though (scope is not going to get updated).

** Don't dirty check when it's not needed
- `fast-bind-on-notify` vs `fast-bind-once` vs `ng-bind`
- check `fast-bind` by kseamon on github.

** Tooling
- Batarang -> Performance
- DevTools Profiler
- `performance.now()` provides high resolution time

* Tips & Tricks
** `ngModel`
*** Writing
**** Watch out when another directive bound to teh same element as the one using `ngModel` is trying to write to scope.
    - If the directive using `ngModel` is an `input[type="file"]`, this will cause a DOM Exception 11 if it's not empty.
    - Work around that by separating the directives, but only if you conclude that this is not a design flaw.

** Hacking core directives

Angular is very hackable due to its modular nature.

As an example: hacking the `ngSrc` directive to apply the `img src` attribute
only when the `src` components are defined:
{{{class='brush: javascript'
angular.module('btford.ng-src', []).
  config(function ($provide) {

    // given `{{x}} y {{z}}` return `['x', 'z']`
    function getExpressions (str) {
      var offset = 0,
          parts = [],
          left,
          right;
      while ((left = str.indexOf('{{', offset)) > -1 &&
             (right = str.indexOf('}}', offset)) > -1) {
        parts.push(str.substr(left+2, right-left-2));
        offset = right + 1;
      }

      return parts;
    }

    $provide.decorator('ngSrcDirective', function ($delegate, $parse) {
      // `$delegate` is an array of directives registered as `ngSrc`
      // btw, did you know you can register multiple directives to the same name?

      // the one we want is the first one.
      var ngSrc = $delegate[0];

      ngSrc.compile = function (element, attrs) {
        var expressions = getExpressions(attrs.ngSrc);
        var getters = expressions.map($parse);

        return function(scope, element, attr) {
          attr.$observe('ngSrc', function(value) {
            if (getters.every(function (getter) { return getter(scope); })) {
              attr.$set('src', value);
            }
          });
        };
      };

      // our compile function above returns a linking function
      // so we can delete this
      delete ngSrc.link;

      return $delegate;
    });
  });
#+end_src

Another tip: the low level boilerplate can be abstracted away with the use of
custom helpers.

{{{class='brush: javascript'
angular.module('btford.ng-src', []).
  hackDirective('ngSrc', function ($delegate) {
    /*
     * ~ do stuff ~
     */

    return $delegate;
  });

// helper definition
(function () {
  var originalModule = angular.module;
  angular.module = function () {
    var module = originalModule.apply(this, arguments);
    module.hackDirective = function (name, fn) {
      module.config(function ($provide) {
        $provide.decorator(name + 'Directive', fn);
      });
    };
    return module;
  }
}());
#+end_src

** Animating ng-if

To animate `ng-if`ed elements, use the following classes:
*** `.ng-if.ng-enter` and `.ng-if.ng-enter-active`,
*** `.ng-if.ng-leave` and `.ng-if.ng-leave-active`,

* Understanding Dependency Injection
** The provider (`$provide`)
Providers define services. To define a `provider`, you need to call the `$provider.provide` method:

#+begin_src js
app.config(function($provide) {
  $provide.provider('greeting', function() {
    this.$get = function() {
      return function(name) {
        alert("Hello, " + name);
      };
    };
  });
});
#+end_src

After doing this, a service called `greeting` can be injected through a variable with the same name. Angular will call the provider's `$get` method underneath.

#+begin_src js
app.config(function($provide) {
  $provide.provider('greeting', function() {
    this.$get = function() {
      return function(name) {
        alert("Hello, " + name);
      };
    };
  });
});
#+end_src

