web/AngularJS.html

<div id="outline-container-org9e63f7f" class="outline-3">
<h3 id="org9e63f7f"><span class="section-number-3">4.4</span> $watch</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>watcher must be fast.</li>
<li>avoid touching the DOM (or use `debounce`)</li>
<li>avoid deep `$watch`</li>
<li>`$watchCollection` is a good alternative for deep watch</li>
<li>watch only relevant data, strip it as much as possible</li>
<li>watch <b>before</b> transforming - watch the input for changes rather than the output of the transformation</li>
</ul>
</div>
</div>

<div id="outline-container-org35d2c8d" class="outline-3">
<h3 id="org35d2c8d"><span class="section-number-3">4.5</span> `$eval`, `$parse` and `interpolate`</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>call `$parse` once and use the returned function instead of calling `$eval`</li>
<li>prefer `$parse` to `$interpolate`</li>
</ul>
</div>
</div>

<div id="outline-container-org10948be" class="outline-3">
<h3 id="org10948be"><span class="section-number-3">4.6</span> track by `$index`</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>when using an `ng-repeat track by $index`, Angular will reuse created DOM nodes instead of creating and destroying every one of them when the model changes.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf67436" class="outline-3">
<h3 id="orgbf67436"><span class="section-number-3">4.7</span> `ng-if` vs `ng-show`</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>first one does not render the DOM, the second one just hides it.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc36a625" class="outline-3">
<h3 id="orgc36a625"><span class="section-number-3">4.8</span> `$$postDigest`</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li>firest a callback after the digest cycle is complete</li>
<li>can be used to update the DOM once after dirty checking is over - not recommended, though (scope is not going to get updated).</li>
</ul>
</div>
</div>

<div id="outline-container-org81326c6" class="outline-3">
<h3 id="org81326c6"><span class="section-number-3">4.9</span> Don't dirty check when it's not needed</h3>
<div class="outline-text-3" id="text-4-9">
<ul class="org-ul">
<li>`fast-bind-on-notify` vs `fast-bind-once` vs `ng-bind`</li>
<li>check `fast-bind` by kseamon on github.</li>
</ul>
</div>
</div>

<div id="outline-container-org2636695" class="outline-3">
<h3 id="org2636695"><span class="section-number-3">4.10</span> Tooling</h3>
<div class="outline-text-3" id="text-4-10">
<ul class="org-ul">
<li>Batarang -&gt; Performance</li>
<li>DevTools Profiler</li>
<li>`performance.now()` provides high resolution time</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9db67b2" class="outline-2">
<h2 id="org9db67b2"><span class="section-number-2">5</span> Tips &amp; Tricks</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org1882424" class="outline-3">
<h3 id="org1882424"><span class="section-number-3">5.1</span> `ngModel`</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-org4d30fa4" class="outline-4">
<h4 id="org4d30fa4"><span class="section-number-4">5.1.1</span> Writing</h4>
<div class="outline-text-4" id="text-5-1-1">
</div><div id="outline-container-orgbe35504" class="outline-5">
<h5 id="orgbe35504"><span class="section-number-5">5.1.1.1</span> Watch out when another directive bound to teh same element as the one using `ngModel` is trying to write to scope.</h5>
<div class="outline-text-5" id="text-5-1-1-1">
<ul class="org-ul">
<li>If the directive using `ngModel` is an `input[type="file"]`, this will cause a DOM Exception 11 if it's not empty.</li>
<li>Work around that by separating the directives, but only if you conclude that this is not a design flaw.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org7afbae9" class="outline-3">
<h3 id="org7afbae9"><span class="section-number-3">5.2</span> Hacking core directives</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Angular is very hackable due to its modular nature.
</p>

<p>
As an example: hacking the `ngSrc` directive to apply the `img src` attribute
only when the `src` components are defined:
{{{class='brush: javascript'
angular.module('btford.ng-src', []).
  config(function ($provide) {
</p>

<p>
// given `{{x}} y {{z}}` return `['x', 'z']`
function getExpressions (str) {
  var offset = 0,
      parts = [],
      left,
      right;
  while ((left = str.indexOf('{{', offset)) &gt; -1 &amp;&amp;
         (right = str.indexOf('}}', offset)) &gt; -1) {
    parts.push(str.substr(left+2, right-left-2));
    offset = right + 1;
  }
</p>

<p>
  return parts;
}
</p>

<p>
$provide.decorator('ngSrcDirective', function ($delegate, $parse) {
  <i>/ `$delegate` is an array of directives registered as `ngSrc`
  /</i> btw, did you know you can register multiple directives to the same name?
</p>

<p>
// the one we want is the first one.
var ngSrc = $delegate[0];
</p>

<p>
ngSrc.compile = function (element, attrs) {
  var expressions = getExpressions(attrs.ngSrc);
  var getters = expressions.map($parse);
</p>

<p>
  return function(scope, element, attr) {
    attr.$observe('ngSrc', function(value) {
      if (getters.every(function (getter) { return getter(scope); })) {
        attr.$set('src', value);
      }
    });
  };
};
</p>

<p>
<i>/ our compile function above returns a linking function
/</i> so we can delete this
delete ngSrc.link;
</p>

<p>
    return $delegate;
  });
});
#+end<sub>src</sub>
</p>

<p>
Another tip: the low level boilerplate can be abstracted away with the use of
custom helpers.
</p>

<p>
{{{class='brush: javascript'
angular.module('btford.ng-src', []).
  hackDirective('ngSrc', function ($delegate) {
    /*
</p>
<ul class="org-ul">
<li>~ do stuff ~</li>
</ul>
<p>
*/
</p>

<p>
  return $delegate;
});
</p>

<p>
// helper definition
(function () {
  var originalModule = angular.module;
  angular.module = function () {
    var module = originalModule.apply(this, arguments);
    module.hackDirective = function (name, fn) {
      module.config(function ($provide) {
        $provide.decorator(name + 'Directive', fn);
      });
    };
    return module;
  }
}());
#+end<sub>src</sub>
</p>
</div>
</div>

<div id="outline-container-orgc5453df" class="outline-3">
<h3 id="orgc5453df"><span class="section-number-3">5.3</span> Animating ng-if</h3>
<div class="outline-text-3" id="text-5-3">
<p>
To animate `ng-if`ed elements, use the following classes:
</p>
</div>
<div id="outline-container-org6b1435d" class="outline-4">
<h4 id="org6b1435d"><span class="section-number-4">5.3.1</span> `.ng-if.ng-enter` and `.ng-if.ng-enter-active`,</h4>
</div>
<div id="outline-container-orga9cfe8a" class="outline-4">
<h4 id="orga9cfe8a"><span class="section-number-4">5.3.2</span> `.ng-if.ng-leave` and `.ng-if.ng-leave-active`,</h4>
</div>
</div>
</div>

<div id="outline-container-orgf8b542f" class="outline-2">
<h2 id="orgf8b542f"><span class="section-number-2">6</span> Understanding Dependency Injection</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgad1a39f" class="outline-3">
<h3 id="orgad1a39f"><span class="section-number-3">6.1</span> The provider (`$provide`)</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Providers define services. To define a `provider`, you need to call the `$provider.provide` method:
</p>

<div class="org-src-container">
<pre class="src src-js">app.config<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">$provide</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  $provide.provider<span style="color: #f0c674;">(</span><span style="color: #8abeb7;">'greeting'</span>, <span style="color: #b5bd68;">function</span><span style="color: #b5bd68;">()</span> <span style="color: #b5bd68;">{</span>
    <span style="color: #81a2be;">this</span>.$get = <span style="color: #b5bd68;">function</span><span style="color: #81a2be;">()</span> <span style="color: #81a2be;">{</span>
      <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">function</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">name</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
        alert<span style="color: #8abeb7;">(</span><span style="color: #8abeb7;">"Hello, "</span> + name<span style="color: #8abeb7;">)</span>;
      <span style="color: #c5c8c6;">}</span>;
    <span style="color: #81a2be;">}</span>;
  <span style="color: #b5bd68;">}</span><span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
After doing this, a service called `greeting` can be injected through a variable with the same name. Angular will call the provider's `$get` method underneath.
</p>

<div class="org-src-container">
<pre class="src src-js">app.config<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">$provide</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  $provide.provider<span style="color: #f0c674;">(</span><span style="color: #8abeb7;">'greeting'</span>, <span style="color: #b5bd68;">function</span><span style="color: #b5bd68;">()</span> <span style="color: #b5bd68;">{</span>
    <span style="color: #81a2be;">this</span>.$get = <span style="color: #b5bd68;">function</span><span style="color: #81a2be;">()</span> <span style="color: #81a2be;">{</span>
      <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">function</span><span style="color: #c5c8c6;">(</span><span style="color: #f0c674;">name</span><span style="color: #c5c8c6;">)</span> <span style="color: #c5c8c6;">{</span>
        alert<span style="color: #8abeb7;">(</span><span style="color: #8abeb7;">"Hello, "</span> + name<span style="color: #8abeb7;">)</span>;
      <span style="color: #c5c8c6;">}</span>;
    <span style="color: #81a2be;">}</span>;
  <span style="color: #b5bd68;">}</span><span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
</div>
