web/AngularJS.org
*** `factory`, `service` and `value`
These methods are just wrappers on the `$provider.provide`, allowing different ways of definition.
The equivalent of the `greeting` provider would be:

#+begin_src js
app.config(function($provide) {
  $provide.factory('greeting', function() {
    return function(name) {
      alert("Hello, " + name);
    };
  });
});
#+end_src

`value` works the same *if* whatever that's being returned from the factory function *does not change*.

*** `module` shorctut for providing
AngularJS exposes the `$provider` methods directly on a module object, so the same results can be achieved by typing simply: 

{{{brush="class: js"
var myMod = angular.module('myModule', []);

myMod.provider("greeting", ...);
myMod.factory("greeting", ...);
myMod.value("greeting", ...);
#+end_src

To summarize, the following do *exactly* the same:

#+begin_src js
myMod.provider('greeting', function() {
  this.$get = function() {
    return function(name) {
      alert("Hello, " + name);
    };
  };
});

myMod.factory('greeting', function() {
  return function(name) {
    alert("Hello, " + name);
  };
});

myMod.value('greeting', function(name) {
  alert("Hello, " + name);
});
#+end_src

** The injector (`$injector`)
The injector creates instances of the services defined by the `$provide` code that has been created.
To use `$injector`, it has to itself be injected into the parameters of e.g. a controller. Then the following can be used:

#+begin_src js
var greeting = $injector.get('greeting');
greeting('Ford Prefect');
#+end_src

Services can also be injected into functions:

#+begin_src js
var greeting = $injector.get('greeting');
greeting('Ford Prefect');
#+end_src

Services can be injected into *any function that is called with `$injector.invoke`*, including:
*** controller/directive/filter definition functions,
*** the `$get` methods of providers.

** Configuring providers
Providers can be configured to define how a given service is constructed. The configuraiton code can be added into the `config` phase of a module as such:

#+begin_src js
myMod.config(function(greeting) {
  // WON'T WORK -- greeting is an *instance* of a service.
  // Only providers for services can be injected in config blocks.
});

myMod.config(function(greetingProvider) {
  // a-ok!
});
#+end_src

There is one important exception: `constants`, since they cannot be changed, are allowed to be injected inside `config` blocks (this is how they differ from `value`s). They are accessed by their name alone (no `Provider` suffix necessary).

Example of what can be done with provider configuration:

#+begin_src js
myMod.provider('greeting', function() {
  var text = 'Hello, ';
      
  this.setText = function(value) {
    text = value;
  };
      
  this.$get = function() {
    return function(name) {
      alert(text + name);
    };
  };
});

myMod.config(function(greetingProvider) {
  greetingProvider.setText("Howdy there, ");
});

myMod.run(function(greeting) {
  greeting('Ford Prefect');
});
#+end_src

