web/AngularJS.html

<div id="outline-container-orgbd07644" class="outline-4">
<h4 id="orgbd07644"><span class="section-number-4">6.1.1</span> `factory`, `service` and `value`</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
These methods are just wrappers on the `$provider.provide`, allowing different ways of definition.
The equivalent of the `greeting` provider would be:
</p>

<div class="org-src-container">
<pre class="src src-js">app.config<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">$provide</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  $provide.factory<span style="color: #f0c674;">(</span><span style="color: #8abeb7;">'greeting'</span>, <span style="color: #b5bd68;">function</span><span style="color: #b5bd68;">()</span> <span style="color: #b5bd68;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">function</span><span style="color: #81a2be;">(</span><span style="color: #f0c674;">name</span><span style="color: #81a2be;">)</span> <span style="color: #81a2be;">{</span>
      alert<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">"Hello, "</span> + name<span style="color: #c5c8c6;">)</span>;
    <span style="color: #81a2be;">}</span>;
  <span style="color: #b5bd68;">}</span><span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
`value` works the same <b>if</b> whatever that's being returned from the factory function <b>does not change</b>.
</p>
</div>
</div>

<div id="outline-container-orge25c416" class="outline-4">
<h4 id="orge25c416"><span class="section-number-4">6.1.2</span> `module` shorctut for providing</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
AngularJS exposes the `$provider` methods directly on a module object, so the same results can be achieved by typing simply: 
</p>

<p>
{{{brush="class: js"
var myMod = angular.module('myModule', []);
</p>

<p>
myMod.provider("greeting", &#x2026;);
myMod.factory("greeting", &#x2026;);
myMod.value("greeting", &#x2026;);
#+end<sub>src</sub>
</p>

<p>
To summarize, the following do <b>exactly</b> the same:
</p>

<div class="org-src-container">
<pre class="src src-js">myMod.provider<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'greeting'</span>, <span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #81a2be;">this</span>.$get = <span style="color: #b5bd68;">function</span><span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">function</span><span style="color: #b5bd68;">(</span><span style="color: #f0c674;">name</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">{</span>
      alert<span style="color: #81a2be;">(</span><span style="color: #8abeb7;">"Hello, "</span> + name<span style="color: #81a2be;">)</span>;
    <span style="color: #b5bd68;">}</span>;
  <span style="color: #f0c674;">}</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;

myMod.factory<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'greeting'</span>, <span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">function</span><span style="color: #f0c674;">(</span><span style="color: #f0c674;">name</span><span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
    alert<span style="color: #b5bd68;">(</span><span style="color: #8abeb7;">"Hello, "</span> + name<span style="color: #b5bd68;">)</span>;
  <span style="color: #f0c674;">}</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;

myMod.value<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'greeting'</span>, <span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">name</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  alert<span style="color: #f0c674;">(</span><span style="color: #8abeb7;">"Hello, "</span> + name<span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3ffc64e" class="outline-3">
<h3 id="org3ffc64e"><span class="section-number-3">6.2</span> The injector (`$injector`)</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The injector creates instances of the services defined by the `$provide` code that has been created.
To use `$injector`, it has to itself be injected into the parameters of e.g. a controller. Then the following can be used:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">greeting</span> = $injector.get<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'greeting'</span><span style="color: #c5c8c6;">)</span>;
greeting<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'Ford Prefect'</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
Services can also be injected into functions:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">greeting</span> = $injector.get<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'greeting'</span><span style="color: #c5c8c6;">)</span>;
greeting<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'Ford Prefect'</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
Services can be injected into <b>any function that is called with `$injector.invoke`</b>, including:
</p>
</div>
<div id="outline-container-orgb4d2a88" class="outline-4">
<h4 id="orgb4d2a88"><span class="section-number-4">6.2.1</span> controller/directive/filter definition functions,</h4>
</div>
<div id="outline-container-org9c2184a" class="outline-4">
<h4 id="org9c2184a"><span class="section-number-4">6.2.2</span> the `$get` methods of providers.</h4>
</div>
</div>

<div id="outline-container-org2b6fd65" class="outline-3">
<h3 id="org2b6fd65"><span class="section-number-3">6.3</span> Configuring providers</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Providers can be configured to define how a given service is constructed. The configuraiton code can be added into the `config` phase of a module as such:
</p>

<div class="org-src-container">
<pre class="src src-js">myMod.config<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">greeting</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">WON'T WORK -- greeting is an *instance* of a service.</span>
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Only providers for services can be injected in config blocks.</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;

myMod.config<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">greetingProvider</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">a-ok!</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
There is one important exception: `constants`, since they cannot be changed, are allowed to be injected inside `config` blocks (this is how they differ from `value`s). They are accessed by their name alone (no `Provider` suffix necessary).
</p>

<p>
Example of what can be done with provider configuration:
</p>

<div class="org-src-container">
<pre class="src src-js">myMod.provider<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'greeting'</span>, <span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">()</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">text</span> = <span style="color: #8abeb7;">'Hello, '</span>;

  <span style="color: #81a2be;">this</span>.setText = <span style="color: #b5bd68;">function</span><span style="color: #f0c674;">(</span><span style="color: #f0c674;">value</span><span style="color: #f0c674;">)</span> <span style="color: #f0c674;">{</span>
    text = value;
  <span style="color: #f0c674;">}</span>;

  <span style="color: #81a2be;">this</span>.$get = <span style="color: #b5bd68;">function</span><span style="color: #f0c674;">()</span> <span style="color: #f0c674;">{</span>
    <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">function</span><span style="color: #b5bd68;">(</span><span style="color: #f0c674;">name</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">{</span>
      alert<span style="color: #81a2be;">(</span>text + name<span style="color: #81a2be;">)</span>;
    <span style="color: #b5bd68;">}</span>;
  <span style="color: #f0c674;">}</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;

myMod.config<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">greetingProvider</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  greetingProvider.setText<span style="color: #f0c674;">(</span><span style="color: #8abeb7;">"Howdy there, "</span><span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;

myMod.run<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">greeting</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  greeting<span style="color: #f0c674;">(</span><span style="color: #8abeb7;">'Ford Prefect'</span><span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
</div>
</div>
