web/AngularJS.org
** Controllers, filters and directives
Filters and directives work analogously to controllers in this context.

Controllers can be injected into, but cannot be injected themselves - they're created by a built-in Angular `$controller` service. 

When defining a controller:

#+begin_src js
myMod.controller('MainController', function($scope) {
  // ...
});
#+end_src

What is actually being done is:

#+begin_src js
myMod.config(function($controllerProvider) {
  controllerProvider.register('MainController', function($scope) {
    // ...
  });
});
#+end_src

For instantiating controllers, Angular uses the `$controller` service, which underneath uses the `$injector`.

** Summary
So, to summarize, any function that gets called with `$injector.invoke` *can be injected into*. This includes, but is not limited to:

*controller
*directive
*factory
*filter
*provider `$get` (when defining provider as an object)
*provider function (when defining provider as a constructor function)
*service

The provider creates new services that *can be injected into things*. This includes:

*constant
*factory
*provider
*service
*value
