web/AngularJS.html

<div id="outline-container-orgb2edb84" class="outline-3">
<h3 id="orgb2edb84"><span class="section-number-3">6.4</span> Controllers, filters and directives</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Filters and directives work analogously to controllers in this context.
</p>

<p>
Controllers can be injected into, but cannot be injected themselves - they're created by a built-in Angular `$controller` service. 
</p>

<p>
When defining a controller:
</p>

<div class="org-src-container">
<pre class="src src-js">myMod.controller<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">'MainController'</span>, <span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">$scope</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">...</span>
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
What is actually being done is:
</p>

<div class="org-src-container">
<pre class="src src-js">myMod.config<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">$controllerProvider</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
  controllerProvider.register<span style="color: #f0c674;">(</span><span style="color: #8abeb7;">'MainController'</span>, <span style="color: #b5bd68;">function</span><span style="color: #b5bd68;">(</span><span style="color: #f0c674;">$scope</span><span style="color: #b5bd68;">)</span> <span style="color: #b5bd68;">{</span>
    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">...</span>
  <span style="color: #b5bd68;">}</span><span style="color: #f0c674;">)</span>;
<span style="color: #8abeb7;">}</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>

<p>
For instantiating controllers, Angular uses the `$controller` service, which underneath uses the `$injector`.
</p>
</div>
</div>

<div id="outline-container-org1ab8a44" class="outline-3">
<h3 id="org1ab8a44"><span class="section-number-3">6.5</span> Summary</h3>
<div class="outline-text-3" id="text-6-5">
<p>
So, to summarize, any function that gets called with `$injector.invoke` <b>can be injected into</b>. This includes, but is not limited to:
</p>

<p>
*controller
*directive
*factory
*filter
*provider `$get` (when defining provider as an object)
*provider function (when defining provider as a constructor function)
*service
</p>

<p>
The provider creates new services that <b>can be injected into things</b>. This includes:
</p>

<p>
*constant
*factory
*provider
*service
*value
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
